import randomId from '@utils/randomId'


export const FILMS_DATA = [
  {
    title: 'Страсті Христові',
    id: randomId(),
    description: 'Фільм «Страсті Христові» розповідає про останні дні життя Божого Сина. Зраджений одним зі своїх учнів,\n' +
      '              Іудою, Ісус виявляється захопленим солдатами під час молитви. Він зупиняє своїх послідовників, які\n' +
      '              мають\n' +
      '              намір вступити в бій з охороною і відправляється на суд. Понтій Пілат має намір провести процедуру за\n' +
      '              всіма правилами, не дивлячись на тиск з боку церкви. Він довіряє віщому сну своєї дружини про Ісуса і\n' +
      '              не\n' +
      '              бажає йому смерті. Пілат двічі дає можливість людям врятувати Христа від страти, але натовп жадає\n' +
      '              крові\n' +
      '              і\n' +
      '              навіть після жорстокого знущання над своєю жертвою відмовляє йому в праві на життя. Ісус змушений сам\n' +
      '              нести свій хрест на шляху до Голгофи. Там його вже знесиленого розпинають разом з двома злочинцями.\n' +
      '              Навіть\n' +
      '              під час нелюдських страждань Христос не думає про себе, а молиться за тих, хто опинився поруч з ним.\n' +
      '              Як\n' +
      '              тільки Ісус вмирає, починається землетрус, що супроводжується зливою. Місто і його мешканці впадають в\n' +
      '              паніку. Так добігають кінця дні на землі Сина Божого, який помер за людські гріхи.'
  },
  {
    title: 'Син Божий',
    id: randomId(),
    description: 'Чергова інтерпретація біблійної "історії" Ісуса Христа втілена в кінофільмі "Син Божий". Це нове бачення\n' +
      '              всіх подій, які супроводжували життєвий шлях Ісуса Христа, від моментів Його появи на Землі і моментів\n' +
      '              Його Вознесіння. Цікавий погляд режисера Крістофера Спенсера дозволяє подивитися вглиб цієї легенди.\n' +
      '              Коли\n' +
      '              Ісус з\'явився на Землі, Він став цікавий оточуючим, адже історія про Його непорочного зачаття по-істині\n' +
      '              потрясла весь світ. Мудрість і знання Сина Божого заслуговує наслідування і багато його послідовників\n' +
      '              стали учнями Ісуса. Отже, першим етапом стає Народження. Другий етап - Його вчення і ходіння по світу з\n' +
      '              метою проповіді. Одним з найбільш яскравих моментів фільму є Розп\'яття Ісуса Христа, яке здатне потрясти\n' +
      '              навіть найсуворіше і кам\'яне серце. В "Сина Божого" розп\'яття представлено не так люто, як це було\n' +
      '              передано глядачам у виконанні режисера Мела Гібсона. Розп\'яття і Вознесіння Ісуса стають по-істині через\n' +
      '              відкуплення всіх гріхів людства. У головній ролі - Діого Моргадо.'
  },
]
