import randomId from '@utils/randomId'

export const FILMS_DATA = [
  {
    title: 'Страсті Христові',
    id: randomId(),
    description: 'Фільм «Страсті Христові» розповідає про останні дні життя Божого Сина. Зраджений одним зі своїх учнів, Іудою, Ісус виявляється захопленим солдатами під час молитви. Він зупиняє своїх послідовників, які мають намір вступити в бій з охороною і відправляється на суд. Понтій Пілат має намір провести процедуру за всіма правилами, не дивлячись на тиск з боку церкви. Він довіряє віщому сну своєї дружини про Ісуса і не бажає йому смерті. Пілат двічі дає можливість людям врятувати Христа від страти, але натовп жадає крові і навіть після жорстокого знущання над своєю жертвою відмовляє йому в праві на життя. Ісус змушений сам нести свій хрест на шляху до Голгофи. Там його вже знесиленого розпинають разом з двома злочинцями. Навіть під час нелюдських страждань Христос не думає про себе, а молиться за тих, хто опинився поруч з ним. Як тільки Ісус вмирає, починається землетрус, що супроводжується зливою. Місто і його мешканці впадають в паніку. Так добігають кінця дні на землі Сина Божого, який помер за людські гріхи.',
    src: 'https://ashdi.vip/vod/79265?'
  },
  {
    title: 'Син Божий',
    id: randomId(),
    description: 'Чергова інтерпретація біблійної "історії" Ісуса Христа втілена в кінофільмі "Син Божий". Це нове бачення всіх подій, які супроводжували життєвий шлях Ісуса Христа, від моментів Його появи на Землі і моментів Його Вознесіння. Цікавий погляд режисера Крістофера Спенсера дозволяє подивитися вглиб цієї легенди. Коли Ісус з\'явився на Землі, Він став цікавий оточуючим, адже історія про Його непорочного зачаття по-істині потрясла весь світ. Мудрість і знання Сина Божого заслуговує наслідування і багато його послідовників стали учнями Ісуса. Отже, першим етапом стає Народження. Другий етап - Його вчення і ходіння по світу з метою проповіді. Одним з найбільш яскравих моментів фільму є Розп\'яття Ісуса Христа, яке здатне потрясти навіть найсуворіше і кам\'яне серце. В "Сина Божого" розп\'яття представлено не так люто, як це було передано глядачам у виконанні режисера Мела Гібсона. Розп\'яття і Вознесіння Ісуса стають по-істині через відкуплення всіх гріхів людства. У головній ролі - Діого Моргадо.',
    src: 'https://ashdi.vip/vod/2089'
  },
  {
    title: 'Ной',
    id: randomId(),
    description: 'Сюжет фільму «Ной» присвячений одній з відомих біблійних історій про Ноєвий Ковчег і кінець світу. Світ загруз в гріхах, життя людей наповнене злом і насильством. Тільки праведник Ной живе зі своїми рідними по біблійних заповідях. Його життям є докір для оточуючих, тому вони вигнали Ноя в пустелю. Одного разу старця починають мучити видіння про жахливий потоп, від якого не можна сховатися. Разом з дружиною і дітьми він пересувається по повній небезпек пустелі, де зустрічає Вартових, які були надіслані Всевишнім як попередження про Кінець Світу і для залякування людей. Ув\'язнені в оболонку з каменю Вартові розповідають свою сумну історію і допомагають родині Ноя. Вони вважають, що не дивлячись на свою гріховність, людина залишається найкращим творінням Творця. Тому вони приводять Ноя з сином Сімом до Адама - прародича їх сім\'ї. Він розповідає Ною про те, що Творець вирішив знищити людство, і тільки його сім\'я зможе вціліти. Праведник Ной розуміє задум Господа - знищити весь бруд, очистити все земне від гріха і відродити нове життя. Що ж повинен зробити Ной, щоб виконати покладену на нього місію?',
    src: 'https://ashdi.vip/vod/11600'
  },
];
